export const faqList = [
    {
        question: 'Что такое аппаратный кошелек OneKey и как он работает?',
        answer: 'Аппаратный кошелек OneKey — это устройство для безопасного хранения ваших криптовалют. Он сохраняет ваши приватные ключи в оффлайн-режиме, защищая их от хакеров и киберугроз, даже при взломе вашего компьютера или телефона. Это одно из самых безопасных решений для долгосрочного хранения криптовалют. Когда вы хотите совершить транзакцию, кошелек подписывает ее локально и передает данные в сеть блокчейна, что обеспечивает максимальную безопасность ваших активов.'
    },
    {
        question: 'Почему именно OneKey?',
        answer: `
        <b>Простота.</b><br/>
         OneKey — это самое простое решение для хранения криптоактивов и NFT, торговли и отслеживания динамики счета. Вместо управления различными активами на разных децентрализованных платформах у вас будет универсальное решение для всех ваших потребностей в управлении криптоактивами.
OneKey специально разработан, чтобы все было просто. Вот почему иногда пользователи, которые уходят в поисках «дополнительных функций», в конечном итоге возвращаются к нам и становятся твердо привержены использованию наших кошельков, потому что другие кошельки слишком сложны. 
        <br/><br/><b>Собственное приложение и поддержка всех платформ.</b><br/>    
        Используйте приложение OneKey для простоты использования и без ущерба для безопасности. Также независимо от того, какую платформу вы предпочитаете: iOS, Android, macOS, Windows, Linux или даже ChromeOS, мы поддерживаем их все.
        <br/>
        <br/>
        <a href="https://1key.so/" target="_blank" style="display: flex; background-color: #45E555; border-radius: 100px; padding: 14px 20px; width: max-content;
    align-items: center;
    font-weight: 700;">
        Открыть приложение
        <div style="width: 35px; margin-left: 10px;">
        <svg width="100%" height="100%" viewBox="0 0 65 64" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clip-rule="evenodd" d="M32.5 64C54.5914 64 64.5 54.0914 64.5 32C64.5 9.90862 54.5914 0 32.5 0C10.4086 0 0.5 9.90862 0.5 32C0.5 54.0914 10.4086 64 32.5 64ZM35.3857 13.5696H26.4834L24.9217 18.292H29.8662V28.2395H35.3857V13.5696ZM42.6504 40.2785C42.6504 45.8856 38.105 50.4311 32.4979 50.4311C26.8908 50.4311 22.3453 45.8856 22.3453 40.2785C22.3453 34.6714 26.8908 30.126 32.4979 30.126C38.105 30.126 42.6504 34.6714 42.6504 40.2785ZM38.0413 40.2785C38.0413 43.3401 35.5594 45.822 32.4978 45.822C29.4363 45.822 26.9544 43.3401 26.9544 40.2785C26.9544 37.217 29.4363 34.735 32.4978 34.735C35.5594 34.735 38.0413 37.217 38.0413 40.2785Z" fill="#16D629"></path><path fillRule="evenodd" clip-rule="evenodd" d="M32.5 64C54.5914 64 64.5 54.0914 64.5 32C64.5 9.90862 54.5914 0 32.5 0C10.4086 0 0.5 9.90862 0.5 32C0.5 54.0914 10.4086 64 32.5 64ZM35.3857 13.5696H26.4834L24.9217 18.292H29.8662V28.2395H35.3857V13.5696ZM42.6504 40.2785C42.6504 45.8856 38.105 50.4311 32.4979 50.4311C26.8908 50.4311 22.3453 45.8856 22.3453 40.2785C22.3453 34.6714 26.8908 30.126 32.4979 30.126C38.105 30.126 42.6504 34.6714 42.6504 40.2785ZM38.0413 40.2785C38.0413 43.3401 35.5594 45.822 32.4978 45.822C29.4363 45.822 26.9544 43.3401 26.9544 40.2785C26.9544 37.217 29.4363 34.735 32.4978 34.735C35.5594 34.735 38.0413 37.217 38.0413 40.2785Z" fill="currentColor"></path></svg>
        </div>
        <a>
        <br/><b>Сквозное шифрование.</b><br/>
        OneKey использует ведущую в отрасли технологию шифрования для локального хранения вашей информации. Только вы можете расшифровать эту информацию.  
        <br/><br/><b>Наши клиенты.</b><br/>    
        Первоклассные криптоинвесторы, отдельные пользователи гигантских китов, биржи, интернет-компании, институциональные инвесторы... почти миллион пользователей из 166 стран на пяти континентах используют OneKey. Наши пользователи представляют все отрасли, которые вы можете представить.
        <br/><br/><b>Безопасность.</b><br/>
        Откажитесь от разочаровывающей и неэффективной децентрализации и повысьте безопасность и эффективность на новый уровень с помощью универсального решения OneKey. OneKey не будет хранить ваши закрытые ключи или фразы для восстановления, все наше оборудование и программное обеспечение имеют <b>открытый исходный код</b>.

    `
    },
    {
        question: 'Предоставляете ли вы официальную гарантию на продукцию OneKey?',
        answer: 'Да, мы являемся официальными реселлерами <a href="https://help.onekey.so/hc/en-us/articles/5967821214223-OneKey-Reseller-Network" target="_blank" class="link-custom">OneKey</a> и предоставляем официальную гарантию на все наши устройства. Вы можете быть уверены в подлинности и качестве продукта, а также получить полную поддержку в случае возникновения проблем с устройством.'
    },
    {
        question: 'Как происходит процесс доставки и сколько времени он занимает?',
        answer: `
        Доставка осуществляется через реализованный на сайте веб-сервис транспортной компании (ТК) СДЭК. При оформлении заказа вы сразу можете ознакомиться со сроками доставки и её стоимостью. Доставку до ТК осуществляем БЕСПЛАТНО на следующий день после оплаты заказа.
        <br/><br/>
При необходимости доставки иными транспортными компаниями свяжитесь с нашим менеджером интернет- магазина. Мы работаем со всеми основными ТК: Деловые Линии, ПЭК, Байкал, DPD, Почта России.

        `
    },
    {
        question: 'Какие способы оплаты вы принимаете?',
        answer: `
        Мы работаем официально и используем на нашем сайте интернет-эквайринг от Т-Банка, таким образом Вам доступны различные виды оплаты: банковской картой, T-Pay, SBER-Pay, СБП.
        <br/>
        Для юридических лиц: если Вы делаете у нас заказ первый раз - нам будут необходимы реквизиты вашей организации, чтобы выставить счет. Юридическим лицам мы выставим счёт и предоставим все закрывающие документы.
        `
    },
    {
        question: 'Предоставляете ли вы поддержку после покупки?',
        answer: `
        Да, мы предлагаем постоянную поддержку после покупки.
        Если у вас возникнут вопросы по использованию устройства, настройке или любой другой проблеме,
        наша команда специалистов всегда готова помочь. Вы можете обратиться в нашу службу поддержки или написать в telegram.
        `
    },
    {
        question: 'Могу ли я использовать кошелек OneKey для работы с разными криптовалютами?',
        answer: `
        Да, аппаратный кошелек OneKey поддерживает более 5000+ криптовалют, включая Bitcoin, Ethereum, Polygon, Avalanche, Solana, Aptos, Near, Tron, Cosmos и многие другие.
        Вы можете увидеть все поддерживаемые сети по адресу <a href="https://onekey.so/cryptos/" target="_blank" class="link-custom">onekey.so/cryptos 
        `
    }
]